# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'

# Binaries
brew 'antibody'
brew 'awscli'
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'fasd'
brew 'fzf'
brew 'git'
brew 'htop'
brew 'jq'
brew 'ncdu'
brew 'pdsh'
brew 'prettyping'
brew 'ripgrep'
brew 'tldr'
brew 'tree'
brew 'zsh'

# Development
brew 'go'
brew 'nvm'

# Apps
cask 'authy'
cask 'boostnote'
cask 'brave-browser'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'fork'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kitty'
cask 'launchbar'
cask 'licecap'
cask 'postman'
cask 'qmk-toolbox'
cask 'quitter'
cask 'rectangle'
cask 'sequel-pro'
cask 'skitch'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoomus'
