tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'awscli'
brew 'bat'
brew 'coreutils'
brew 'fzf'
brew 'git'
brew 'go'
brew 'htop'
brew 'jq'
brew 'kubie'
brew 'mas'
brew 'neovim'
brew 'ncdu'
brew 'nvm'
brew 'pdsh'
brew 'prettyping'
brew 'pyenv'
brew 'ripgrep'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'zoxide'
brew 'zsh'

cask 'arc'
cask 'authy'
cask 'dbeaver-community'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'fork'
cask 'insomnia'
cask 'karabiner-elements'
cask 'licecap'
cask 'obsidian'
cask 'openscad'
cask 'qmk-toolbox'
cask 'quitter'
cask 'raycast'
cask 'robo-3t'
cask 'shottr'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'warp'
cask 'zoom'

cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-mono-nerd-font'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

mas 'Numbers', id: 409203825
mas 'StatusClock', id: 552792489
mas 'Xcode', id: 497799835
