# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'jason0x43/neovim-nightly'

# Binaries
brew 'antibody'
brew 'awscli'
brew 'bat'
brew 'coreutils'
brew 'fasd'
brew 'fzf'
brew 'git'
brew 'htop'
brew 'jq'
brew 'mas'
brew 'ncdu'
brew 'pdsh'
brew 'prettyping'
brew 'ripgrep'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'zsh'

# Development
brew 'go'
brew 'nvm'

# Apps
cask 'alacritty'
cask 'alfred'
cask 'authy'
cask 'boostnote'
cask 'brave-browser'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'fork'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kitty'
cask 'licecap'
cask 'neovim-nightly'
cask 'obsidian'
cask 'pgadmin4'
cask 'postman'
cask 'qmk-toolbox'
cask 'quitter'
cask 'rectangle'
cask 'sequel-pro'
cask 'skitch'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-mono-nerd-font'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
mas 'Numbers', id: 409203825
mas 'StatusClock', id: 552792489
mas 'Xcode', id: 497799835